/*Задано бинарное  дерево.  Построить  прошитое   дерево,
соответствующее обходу сверху вниз. Составить программу удале-
ния поддерева с  корнем  в  заданной  вершине  без  повторного
построения дерева. Конечное дерево должно оставаться прошитым. 
Выдать информацию о нитях исходного и конечного деревьев (12).
Орзаев Святослав, ПС-21, Microsoft Visual Studio*/


#include <iostream>
#include <string>
#include <vector>

using namespace std;

struct Tree
{
	string name;
	Tree* left;
	Tree* right;
};



int main()
{
}

